#pragma once

#include "../SketchMusic.h"

/**
 * Класс, определяющий единицу текста.
 * todo : сделать строго внутренним элементом компонента, тем самым сделать его невидимым
 * для пользователей, зато получить возможность наследования от него.
 * С другой стороны, если сделать символ унифицированным, не будет геморроя с его использованием.
 * С третей стороны, будет чёткое разграничение символов в связи с их назначение.
 * todo : символ как интерфейс? тогда можно и наследовать, и вообще.
 */
//public interface class SketchMusic::ISymbol : public IInspectable;

